Revit 2024 API
FabricationPart.ItemCustomId Property
 The item custom identifier for the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public int ItemCustomId { get; }
Visual Basic
Public ReadOnly Property ItemCustomId As Integer
	Get
Visual C++
public:
property int ItemCustomId {
	int get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace